[
	{
	  "workplace": "Globallogic",
	  "date": "May 2020 - Present",
	  "position": "SDET/Automation Lead",
	  "description": "At Globallogic, I work on diverse projects in the medical and e-commerce sectors, in SDET and Lead roles, leading and collaborating with teams of up to 8 test automation engineers. I design and maintain robust automation frameworks for web UI, API, desktop, and performance testing, using Java, Groovy, C#, and JavaScript. My focus is on ensuring strategic test coverage, applying the test pyramid approach across the SDLC, and continuously improving processes to deliver high-quality results. Technology stack: Java, C#, JavaScript, TypeScript, Groovy, Cucumber, Junit, TestNg, Spock, Selenium WebDriver, Selenide, RestAssured, Appium, CodedUI, Playwright, K6, Azure.",
	  "subtopic": "Key responsibilities:",
	  "responsibilities": [
		"Managing and coordinating the QA team’s activities and priorities",
		"Leading the design, development, and continuous improvement of test automation frameworks",
		"Defining and implementing balanced test strategies (unit, integration, E2E) across the SDLC to ensure effective coverage and maintain rapid, reliable delivery",
		"Developing and maintaining automated tests for web UI, API, mobile, and desktop applications",
		"Designing and executing performance and load tests using Grafana k6 and JavaScript",
		"Building custom tools, utilities, and integrations to support efficient test automation and reporting",
		"Monitoring test results, analyzing failures, and driving defect resolution in collaboration with developers and stakeholders",
		"Presenting team progress, test results, and key achievements to stakeholders and leadership",
		"Interviewing, onboarding, and mentoring new team members, conducting code reviews, and promoting best practices within the team",
		"Continuously assessing and improving QA processes, tools, and metrics to align with project and business goals\n"
	  ]
	},
	{
	  "workplace": "FDI Ukraine",
	  "date": "July 2019 - March 2020",
	  "position": "Test Automation Tech Lead",
	  "description": "FDI Ukraine was a product company delivering a suite of services and applications under the Kyiv Smart City initiative. The solutions aimed to improve city infrastructure and services for residents and authorities.\nTechnology stack: Java 11, Maven, JUnit 5, Selenide, RestAssured, Allure, Docker, TestContainers, MySQL.",
	  "subtopic": "Key responsibilities:",
	  "responsibilities": [
		"Led a team of test automation engineers, driving quality initiatives across multiple projects within the Kyiv Smart City program",
		"Designed, developed, and integrated robust test automation processes, frameworks, and tools to ensure scalable, maintainable test coverage",
		"Created key utilities, custom tools, and reusable helpers to accelerate development and testing workflows",
		"Mentored team members through knowledge sharing, pair programming, and comprehensive code reviews to uphold high code standards",
		"Developed automated tests for web UI and API layers using Selenide, RestAssured, and other modern frameworks",
		"Set up and maintained test environments using Docker and TestContainers for reliable and repeatable test execution",
		"Collaborated with cross-functional teams to align test strategies with development goals and delivery timelines."
	  ]
	},
	{
	  "workplace": "Lohika Systems",
	  "date": "July 2017 - April 2019",
	  "position": "Senior Test Automation Engineer / Java Backend Developer",
	  "description": "I started at Lohika as an Automation Engineer, later transitioning to a Java Backend Developer role to meet project needs — which I gladly embraced.",
	  "subtopic": "Primary responsibilities:",
	  "responsibilities": [
		"Developing and maintaining test automation frameworks from scratch for both API and UI testing",
		"Maintaining Gatling performance tests written in Scala",
		"Developing automated tests using Java stack: Java 8, JUnit 4, Selenide, RestAssured",
		"Setting up CI pipelines using Jenkins",
		"Backend development using Java stack: Java 8–9, Spring Boot, Spring MVC, Spring Data, Kafka, CouchDB, MongoDB, Apache POI, Apache PDFBox",
		"Writing unit and integration tests to support TDD practices"
	  ]
	},
	{
	  "mentoring": true,
	  "workplace": "State University of Telecommunications",
	  "date": "September 2017 - June 2018",
	  "position": "University Lecturer",
	  "description": "I lectured on software engineering and quality assurance for over 200 students in total. It was a rewarding, yet exhausting experience."
	},
	{
	  "mentoring": true,
	  "workplace": "Epam Systems",
	  "date": "April 2017 - August 2017",
	  "position": "Test Automation Lecturer and Mentor at EPAM Resource Development Lab",
	  "description": "I worked at the EPAM Resource Development Lab, located in Kyiv Polytechnic Institute, as a lecturer for a test automation course for a group of 20+ students."
	},
	{
	  "mentoring": true,
	  "workplace": "SmartImprove.me",
	  "date": "February 2017 - April 2017",
	  "position": "Lecturer & Mentor",
	  "description": "",
	  "subtopic": "The following topics were covered during the course:",
	  "responsibilities": [
		"Tools for test automation",
		"Test automation frameworks",
		"Test automation techniques and patterns",
		"Build tools",
		"CI systems"
	  ]
	},
	{
	  "workplace": "Levi9",
	  "date": "August 2016 - July 2017",
	  "position": "Senior Test Automation Engineer",
	  "description": "I worked at Levi9 as a consultant for a Dutch company in an R&D team responsible for developing new features for a banking application, including improvements and PoCs."
	},
	{
	  "workplace": "EPAM Systems",
	  "date": "September 2015 - August 2016",
	  "position": "Middle Test Automation Engineer",
	  "description": "I worked as a test automation engineer on a large-scale e-commerce project for the biggest retail company in Canada, collaborating with a large, distributed, multilingual team."
	},
	{
	  "workplace": "Softengi - Inspired Software Engineering",
	  "date": "June 2014 - September 2015",
	  "position": "Manual/Automation QA Engineer",
	  "description": "I worked on an ERP project for an American company. The application was large and legacy — our automated regression test suite (aroung 500 tests) took about 16 hours to run in a single thread."
	}
  ]
  